export const quizData = [
    // No. 6 index = 0
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [0],
        model: "../assets/models/wheel6.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "คุณตรวจสอบครบทั้ง 9 จุด และล้อนี้ไม่มีตำหนิทุกจุด ซึ่งการตรวจสอบล้อหลังหล่อมี 9 จุด ได้แก่ 1) ตรวจสปรูล้อ 2) ตรวจตัวหนังสือหน้าล้อ 3) ตรวจตัวหนังสือหลังล้อ 4) ตรวจครีบหน้าฟิต ครีบขอบบน  และครีบขอบล่าง 5) ตรวจรอย Pin รอบวง และ Pin กลาง 6) ตรวจบาร์โค๊ดล้อ 7) ตรวจครีบแนวประกบ  Side 8) ตรวจ Side เหลื่อม 9) ตรวจผิวล้อด้านนอกและด้านใน",
            incorrect: "ลองตรวจสอบให้ละเอียดทุกจุดตามมาตรฐานที่กำหนด"
        },
        onIncorrect: 1
    },
    // No. 7 index = 1
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [0],
        model: "../assets/models/wheel7.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "คุณตรวจสอบครบทั้ง 9 จุด และล้อนี้ไม่มีตำหนิทุกจุด ซึ่งการตรวจสอบล้อหลังหล่อมี 9 จุด ได้แก่ 1) ตรวจสปรูล้อ 2) ตรวจตัวหนังสือหน้าล้อ 3) ตรวจตัวหนังสือหลังล้อ 4) ตรวจครีบหน้าฟิต ครีบขอบบน  และครีบขอบล่าง 5) ตรวจรอย Pin รอบวง และ Pin กลาง 6) ตรวจบาร์โค๊ดล้อ 7) ตรวจครีบแนวประกบ  Side 8) ตรวจ Side เหลื่อม 9) ตรวจผิวล้อด้านนอกและด้านใน",
            incorrect: "ลองตรวจสอบให้ละเอียดทุกจุดตามมาตรฐานที่กำหนด"
        },
        onIncorrect: [0]
    },
    // No. 8 index = 2
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel8.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อด้านนอกให้ละเอียดขึ้น"
        },
        onIncorrect: 1
    },
    // No. 8 index = 3
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน (มี 2 คำตอบ)",
        options: ["สปรูล้อมีรอยกลวง กลางจุก", "ตัวหนังสือหน้าล้อมีรอยเย็นเงา", "บาร์โค๊ด มีรอยกระแทก รอยแหว่ง", "ผิวล้อมีรอยกระแทก"],
        correctAnswer: [0, 2],
        model: "../assets/models/wheel8.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน เพราะ สปรูล้อมีรอยกลวง กลางจุก และบาร์โค๊ด มีรอยกระแทก รอยแหว่ง",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อด้านนอกให้ละเอียดขึ้น"
        },
        onIncorrect: [1]
    },
    // No. 9 index = 4
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel9.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: 2
    },
    // No. 9 index = 5
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน (มี 2 คำตอบ)",
        options: ["สปรูล้อมีรอยกร่อนลึก", "ตัวหนังสือหน้าล้อไม่คมชัดทุกตัว ขาด แหว่ง", "ตัวหนังสือหลังล้อมีรอยเย็นเงา", "บาร์โค๊ดมีครีป"],
        correctAnswer: [1, 3],
        model: "../assets/models/wheel9.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐานเพราะ ตัวหนังสือหน้าล้อไม่คมชัดทุกตัว ขาด แหว่ง และบาร์โค๊ดมีครีป",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: [2]
    },
    // No. 9 index = 6
    {
        question: "คุณคิดว่ามีจุดใดอีกที่ไม่ผ่านมาตรฐาน",
        options: ["สปรูล้อมีรอยกร่อนลึก", "ตัวหนังสือหน้าล้อมีสิ่งแปลกปลอมแทรกในร่อง", "บาร์โค๊ด ชื่อรุ่นล้อไม่ถูกต้องตรง Tag", "ผิวล้อหยาบและเย็นเงา"],
        correctAnswer: [3],
        model: "../assets/models/wheel9.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน 3 จุด ได้แก่ ตัวหนังสือหน้าล้อไม่คมชัดทุกตัว ขาด แหว่ง บาร์โค๊ดมีครีป และผิวล้อหยาบและเย็นเงา",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: [2]
    },
    // No. 10 index = 7
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel10.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อ หลังล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: 4
    },
    // No. 10 index = 8
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน (มี 2 คำตอบ)",
        options: ["บริเวณบอร์มีรอยแตก รอยยุบ", "ตัวหนังสือหน้าล้อมีสิ่งแปลกปลอมแทรกในร่อง", "ตัวหนังสือหลังล้อไม่คมชัดทุกตัว ขาด แหว่ง", "บาร์โค๊ด ชื่อรุ่นล้อไม่ถูกต้องตรง Tag"],
        correctAnswer: [0, 2],
        model: "../assets/models/wheel10.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐานเพราะ บริเวณบอร์มีรอยแตก รอยยุบ และตัวหนังสือหลังล้อไม่คมชัดทุกตัว ขาด แหว่ง",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อ หลังล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: [4]
    },
    // No. 10 index = 9
    {
        question: "คุณคิดว่ามีจุดใดอีกที่ไม่ผ่านมาตรฐาน",
        options: ["ผิวล้อมีรอยจิกและรอยกระแทก", "สปรูล้อมีรอยกร่อนลึก", "ตัวหนังสือหลังล้อมีรอยเย็นเงา", "ตัวหนังสือหน้าล้อมีสิ่งแปลกปลอมแทรกในร่อง"],
        correctAnswer: [0],
        model: "../assets/models/wheel10.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน 3 จุด ได้แก่ บริเวณบอร์มีรอยแตก รอยยุบ ตัวหนังสือหลังล้อไม่คมชัดทุกตัว ขาด แหว่ง และผิวล้อมีรอยจิกและรอยกระแทก",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อ หลังล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: [4]
    },
    // No. 11 index = 10
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: 7
    },
    // No. 11 index = 11
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["ครีบหน้าฟิต", "ครีบขอบบน และครีบขอบล่าง", "รอย Pin กลาง", "ครีบแนวประกบ Side"],
        correctAnswer: [0],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ครีบหน้าฟิตไม่ผ่านมาตรฐาน สังเกตจากความหนาของครีบ",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: [7]
    },
    // No. 12 index = 12
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า ครีบหน้าฟิตไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [0],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ครีบหน้าฟิตใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า",
            incorrect: "การตรวจสอบครีปหน้าฟิตใช้เครื่องมือเดียวกับการตรวจสอบครีบขอบบน ครีบขอบล่าง และครีบแนวประกบ Side"
        },
        onIncorrect: 10
    },
    // No. 12 index = 13
    {
        question: "ครีบหน้าฟิตต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [1],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ครีบหน้าฟิตใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.5 มม. ตามมาตรฐาน",
            incorrect: "ค่ามาตรฐานของครีปหน้าฟิตใช้ค่าเดียวกับค่ามาตรฐานของครีบขอบบน และครีบขอบล่าง"
        },
        onIncorrect: [10]
    },
    // No. 13 index = 14
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณรอบ ๆ ล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: 12
    },
    // No. 13 index = 15
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["ครีบหน้าฟิต", "ครีบขอบบน และครีบขอบล่าง", "รอย Pin กลาง", "ครีบแนวประกบ Side"],
        correctAnswer: [1],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบขอบบน และครีบขอบล่างไม่ผ่านมาตรฐาน สังเกตจากความหนาของครีบ",
            incorrect: "ลองตรวจสอบบริเวณรอบ ๆ ล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: [12]
    },
    // No. 14 index = 16
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า ครีบขอบบน และครีบขอบล่างไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [0],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบขอบบน และครีบขอบล่างใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า",
            incorrect: "การตรวจสอบครีบขอบบน และครีบขอบใช้เครื่องมือเดียวกับการตรวจสอบล่างครีปหน้าฟิต และครีบแนวประกบ Side"
        },
        onIncorrect: 14
    },
    // No. 14 index = 17
    {
        question: "ครีบขอบบน และครีบขอบล่างต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [1],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบขอบบน และครีบขอบล่างใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.5 มม. ตามมาตรฐาน",
            incorrect: "ค่ามาตรฐานของครีบขอบบน และครีบขอบล่างใช้ค่าเดียวกับค่ามาตรฐานของครีบหน้าฟิต"
        },
        onIncorrect: [14]
    },
    // No. 15 index = 18
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหลังล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: 16
    },
    // No. 15 index = 19
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["ครีบขอบบน และครีบขอบล่าง", "รอย Pin รอบวง", "รอย Pin กลาง", "Side เหลื่อม"],
        correctAnswer: [1],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin รอบวงไม่ผ่านมาตรฐาน สังเกตจากความหนาของ Pin",
            incorrect: "ลองตรวจสอบบริเวณหลังล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: [16]
    },
    // No. 16 index = 20
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า รอย Pin รอบวงไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ (มี 2 คำตอบ)",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [1, 2],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin รอบวงใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า",
            incorrect: "การตรวจสอบรอย Pin รอบวงใช้เครื่องมือเดียวกับการตรวจสอบรอย Pin กลาง และ Side เหลื่อม"
        },
        onIncorrect: 18
    },
    // No. 16 index = 21
    {
        question: "รอย Pin รอบวงต้องสั้นหรือยาวไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin รอบวงใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ค่ามาตรฐานของรอย Pin รอบวงใช้ค่าเดียวกับค่ามาตรฐานของรอย Pin กลาง ครีบแนวประกบ Side และ Side เหลื่อม"
        },
        onIncorrect: [18]
    },
    // No. 17 index = 22
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าล้อ หรือหลังให้ละเอียดมากขึ้น"
        },
        onIncorrect: 20
    },
    // No. 17 index = 23
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["รอย Pin รอบวง", "รอย Pin กลาง", "ครีบแนวประกบ Side", "Side เหลื่อม"],
        correctAnswer: [1],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin กลางไม่ผ่านมาตรฐาน สังเกตจากความหนาของ Pin",
            incorrect: "ลองตรวจสอบบริเวณหน้าล้อ หรือหลังให้ละเอียดมากขึ้น"
        },
        onIncorrect: [20]
    },
    // No. 18 index = 24
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า รอย Pin กลางไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ (มี 2 คำตอบ)",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [1, 2],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin กลางใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า",
            incorrect: "การตรวจสอบรอย Pin กลางใช้เครื่องมือเดียวกับการตรวจสอบรอย Pin รอบวง และ Side เหลื่อม"
        },
        onIncorrect: 22
    },
    // No. 18 index = 25
    {
        question: "รอย Pin กลางต้องสั้นหรือยาวไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin กลางใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ค่ามาตรฐานของรอย Pin กลางใช้ค่าเดียวกับค่ามาตรฐานของรอย Pin รอบวง ครีบแนวประกบ Side และ Side เหลื่อม"
        },
        onIncorrect: [22]
    },
    // No. 19 index = 26
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า ครีบแนวประกบ Side ไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [0],
        model: "../assets/models/wheel19.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบแนวประกบ Side ใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า",
            incorrect: "การตรวจสอบครีบแนวประกบ Side ใช้เครื่องมือเดียวกับการตรวจสอบล่างครีปหน้าฟิต และครีบขอบบน และครีบขอบล่าง"
        },
        onIncorrect: 24
    },
    // No. 19 index = 27
    {
        question: "ครีบแนวประกบ Side ต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel19.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบแนวประกบ Side ใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ค่ามาตรฐานของครีบแนวประกบ Side ใช้ค่าเดียวกับค่ามาตรฐานของรอย Pin รอบวง รอย Pin กลาง และ Side เหลื่อม"
        },
        onIncorrect: [24]
    },
    // No. 20 index = 28
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า Side เหลื่อมไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ (มี 2 คำตอบ)",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [1, 2],
        model: "../assets/models/wheel20.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "Side เหลื่อมใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า",
            incorrect: "การตรวจสอบ Side เหลื่อมใช้เครื่องมือเดียวกับการตรวจสอบรอย Pin รอบวง และรอย Pin กลาง"
        },
        onIncorrect: 26
    },
    // No. 20 index = 29
    {
        question: "Side เหลื่อมต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel20.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "Side เหลื่อมใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ค่ามาตรฐานของ Side เหลื่อมใช้ค่าเดียวกับค่ามาตรฐานของรอย Pin รอบวง รอย Pin กลาง และครีบแนวประกบ Side"
        },
        onIncorrect: [26]
    },

];