export const quizData = [
    // No. 6 index = 0
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [0],
        model: "../assets/models/wheel6.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "คุณตรวจสอบครบทั้ง 9 จุด และล้อนี้ไม่มีตำหนิทุกจุด ซึ่งการตรวจสอบล้อหลังหล่อมี 9 จุด ได้แก่ 1) ตรวจสปรูล้อ 2) ตรวจตัวหนังสือหน้าล้อ 3) ตรวจตัวหนังสือหลังล้อ 4) ตรวจครีบหน้าฟิต ครีบขอบบน  และครีบขอบล่าง 5) ตรวจรอย Pin รอบวง และ Pin กลาง 6) ตรวจบาร์โค๊ดล้อ 7) ตรวจครีบแนวประกบ  Side 8) ตรวจ Side เหลื่อม 9) ตรวจผิวล้อด้านนอกและด้านใน",
            incorrect: "ลองตรวจสอบให้ละเอียดทุกจุดตามมาตรฐานที่กำหนด"
        },
        onIncorrect: 1
    },
    // No. 7 index = 1
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [0],
        model: "../assets/models/wheel7.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "คุณตรวจสอบครบทั้ง 9 จุด และล้อนี้ไม่มีตำหนิทุกจุด ซึ่งการตรวจสอบล้อหลังหล่อมี 9 จุด ได้แก่ 1) ตรวจสปรูล้อ 2) ตรวจตัวหนังสือหน้าล้อ 3) ตรวจตัวหนังสือหลังล้อ 4) ตรวจครีบหน้าฟิต ครีบขอบบน  และครีบขอบล่าง 5) ตรวจรอย Pin รอบวง และ Pin กลาง 6) ตรวจบาร์โค๊ดล้อ 7) ตรวจครีบแนวประกบ  Side 8) ตรวจ Side เหลื่อม 9) ตรวจผิวล้อด้านนอกและด้านใน",
            incorrect: "ลองตรวจสอบให้ละเอียดทุกจุดตามมาตรฐานที่กำหนด"
        },
        onIncorrect: [0]
    },
    // No. 8 index = 2
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel8.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 0,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อด้านนอกให้ละเอียดขึ้น"
        },
        onIncorrect: 1
    },
    // No. 8 index = 3
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["สปรูล้อมีรอยกลวง กลางจุก", "ตัวหนังสือหน้าล้อมีรอยเย็นเงา", "ตัวหนังสือหลังล้อมีสิ่งแปลกปลอมแทรกในร่อง", "บาร์โค๊ด มีรอยกระแทก รอยแหว่ง", "ผิวล้อมีรอยกระแทก"],
        correctAnswer: [0, 3],
        model: "../assets/models/wheel8.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน เพราะ สปรูล้อมีรอยกลวง กลางจุกและบาร์โค๊ด มีรอยกระแทก รอยแหว่ง",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อด้านนอกให้ละเอียดขึ้น"
        },
        onIncorrect: [1]
    },
    // No. 9 index = 4
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel9.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 0,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: 2
    },
    // No. 9 index = 5
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["สปรูล้อมีรอยกร่อนลึก", "ตัวหนังสือหน้าล้อไม่คมชัดทุกตัว ขาด แหว่ง", "ตัวหนังสือหลังล้อมีรอยเย็นเงา", "บาร์โค๊ดมีครีป", "ผิวล้อหยาบและเย็นเงา"],
        correctAnswer: [1, 3, 4],
        model: "../assets/models/wheel9.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐานเพราะ ตัวหนังสือหน้าล้อไม่คมชัดทุกตัว ขาด แหว่ง บาร์โค๊ดมีครีป และผิวล้อหยาบและเย็นเงา",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: [2]
    },
    // No. 10 index = 6
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel10.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 0,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อ หลังล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: 4
    },
    // No. 10 index = 7
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["บริเวณบอร์มีรอยแตก รอยยุบ", "ตัวหนังสือหน้าล้อมีสิ่งแปลกปลอมแทรกในร่อง", "ตัวหนังสือหลังล้อไม่คมชัดทุกตัว ขาด แหว่ง", "บาร์โค๊ด ชื่อรุ่นล้อไม่ถูกต้องตรง Tag", "ผิวล้อมีรอยจิกและรอยกระแทก"],
        correctAnswer: [0, 2, 4],
        model: "../assets/models/wheel10.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐานเพราะ บริเวณบอร์มีรอยแตก รอยยุบ ตัวหนังสือหลังล้อไม่คมชัดทุกตัว ขาด แหว่ง และผิวล้อมีรอยจิกและรอยกระแทก",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อ หลังล้อและผิวล้อให้ละเอียดขึ้น"
        },
        onIncorrect: [4]
    },
    // No. 11 index = 8
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 0,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: 6
    },
    // No. 11 index = 9
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["ครีบหน้าฟิต", "ครีบขอบบน และครีบขอบล่าง", "รอย Pin รอบวง", "รอย Pin กลาง", "ครีบแนวประกบ Side", "Side เหลื่อม"],
        correctAnswer: [0],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ครีบหน้าฟิตไม่ผ่านมาตรฐาน สังเกตจากความหนาของครีบ",
            incorrect: "ลองตรวจสอบบริเวณหน้าลายล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: [6]
    },
    // No. 12 index = 10
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า ครีบหน้าฟิตไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [0],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 0,
        feedback: {
            correct: "ครีบหน้าฟิตใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า",
            incorrect: "ลองศึกษาวิธีการตรวจสอบครีปหน้าฟิตด้วยเครื่องมือวัด"
        },
        onIncorrect: 8
    },
    // No. 12 index = 11
    {
        question: "ครีบหน้าฟิตต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [1],
        model: "../assets/models/wheel11.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ครีบหน้าฟิตใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.5 มม. ตามมาตรฐาน",
            incorrect: "ลองศึกษาวิธีการตรวจสอบครีปหน้าฟิตด้วยเครื่องมือวัดและค่ามาตรฐานที่กำหนด"
        },
        onIncorrect: [8]
    },
    // No. 13 index = 12
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 0,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณรอบ ๆ ล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: 10
    },
    // No. 13 index = 13
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["ครีบหน้าฟิต", "ครีบขอบบน และครีบขอบล่าง", "รอย Pin รอบวง", "รอย Pin กลาง", "ครีบแนวประกบ Side", "Side เหลื่อม"],
        correctAnswer: [1],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบขอบบน และครีบขอบล่างไม่ผ่านมาตรฐาน สังเกตจากความหนาของครีบ",
            incorrect: "ลองตรวจสอบบริเวณรอบ ๆ ล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: [10]
    },
    // No. 14 index = 14
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า ครีบขอบบน และครีบขอบล่างไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [0],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 0,
        feedback: {
            correct: "ครีบขอบบน และครีบขอบล่างใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า",
            incorrect: "ลองศึกษาวิธีการตรวจสอบครีบขอบบน และครีบขอบล่างด้วยเครื่องมือวัด"
        },
        onIncorrect: 12
    },
    // No. 14 index = 15
    {
        question: "ครีบขอบบน และครีบขอบล่างต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [1],
        model: "../assets/models/wheel13.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบขอบบน และครีบขอบล่างใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.5 มม. ตามมาตรฐาน",
            incorrect: "ลองศึกษาวิธีการตรวจสอบครีบขอบบน และครีบขอบล่างด้วยเครื่องมือวัดและค่ามาตรฐานที่กำหนด"
        },
        onIncorrect: [12]
    },
    // No. 15 index = 16
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 0,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหลังล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: 14
    },
    // No. 15 index = 17
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["ครีบหน้าฟิต", "ครีบขอบบน และครีบขอบล่าง", "รอย Pin รอบวง", "รอย Pin กลาง", "ครีบแนวประกบ Side", "Side เหลื่อม"],
        correctAnswer: [2],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin รอบวงไม่ผ่านมาตรฐาน สังเกตจากความหนาของ Pin",
            incorrect: "ลองตรวจสอบบริเวณหลังล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: [14]
    },
    // No. 16 index = 18
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า รอย Pin รอบวงไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [1, 2],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 0,
        feedback: {
            correct: "รอย Pin รอบวงใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า",
            incorrect: "ลองศึกษาวิธีการตรวจสอบรอย Pin รอบวงด้วยเครื่องมือวัด"
        },
        onIncorrect: 16
    },
    // No. 16 index = 19
    {
        question: "รอย Pin รอบวงต้องสั้นหรือยาวไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel15.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin รอบวงใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ลองศึกษาวิธีการตรวจสอบรอย Pin รอบวงด้วยเครื่องมือวัดและค่ามาตรฐานที่กำหนด"
        },
        onIncorrect: [16]
    },
    // No. 17 index = 20
    {
        question: "คุณคิดว่าล้อวงนี้ผ่านเกณฑ์มาตรฐานการผลิตหรือไม่",
        options: ["ผ่าน", "ไม่ผ่าน"],
        correctAnswer: [1],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 0,
        feedback: {
            correct: "ล้อวงนี้ไม่ผ่านเกณฑ์มาตรฐาน",
            incorrect: "ลองตรวจสอบบริเวณหลังล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: 18
    },
    // No. 17 index = 21
    {
        question: "คุณคิดว่าจุดใดบ้างที่ไม่ผ่านมาตรฐาน",
        options: ["ครีบหน้าฟิต", "ครีบขอบบน และครีบขอบล่าง", "รอย Pin รอบวง", "รอย Pin กลาง", "ครีบแนวประกบ Side", "Side เหลื่อม"],
        correctAnswer: [3],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "ครีบหน้าฟิตไม่ผ่านมาตรฐาน สังเกตจากความหนาของครีบ",
            incorrect: "ลองตรวจสอบบริเวณหลังล้อให้ละเอียดมากขึ้น"
        },
        onIncorrect: [18]
    },
    // No. 18 index = 22
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า รอย Pin กลางไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [1, 2],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 0,
        feedback: {
            correct: ": รอย Pin กลางใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า",
            incorrect: "ลองศึกษาวิธีการตรวจสอบรอย Pin รอบวงด้วยเครื่องมือวัด"
        },
        onIncorrect: 20
    },
    // No. 18 index = 23
    {
        question: "รอย Pin กลางต้องสั้นหรือยาวไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel17.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "รอย Pin กลางใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ลองศึกษาวิธีการตรวจสอบรอย Pin รอบวงด้วยเครื่องมือวัดและค่ามาตรฐานที่กำหนด"
        },
        onIncorrect: [20]
    },
    // No. 19 index = 24
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า ครีบแนวประกบ Side ไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [0],
        model: "../assets/models/wheel19.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 0,
        feedback: {
            correct: "ครีบแนวประกบ Side ใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า",
            incorrect: "ลองศึกษาวิธีการตรวจสอบครีบแนวประกบ Side ด้วยเครื่องมือวัด"
        },
        onIncorrect: 22
    },
    // No. 19 index = 25
    {
        question: "ครีบแนวประกบ Side ต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel19.glb",
        scale: "1 1 1",
        position: "-0.2 0 -3",
        points: 1,
        feedback: {
            correct: "ครีบแนวประกบ Side ใช้เวอร์เนียร์คาร์ลิปเปอร์ในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ลองศึกษาวิธีการตรวจสอบครีบแนวประกบ Side ด้วยเครื่องมือวัดและค่ามาตรฐานที่กำหนด"
        },
        onIncorrect: [22]
    },
    // No. 20 index = 26
    {
        question: "คุณตรวจสอบล้อวงนี้แล้วพบว่า Side เหลื่อมไม่ผ่านมาตรฐาน คุณใช้เครื่องมือใดในการตรวจสอบ",
        options: ["เวอร์เนียร์คาร์ลิปเปอร์", "เวอร์เนียร์วัดลึก", "ฟิลเลอร์เกจ", "ไมโครมิเตอร์"],
        correctAnswer: [1, 2],
        model: "../assets/models/wheel20.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 0,
        feedback: {
            correct: "Side เหลื่อมใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า",
            incorrect: "ลองศึกษาวิธีการตรวจสอบSide เหลื่อมด้วยเครื่องมือวัด"
        },
        onIncorrect: 24
    },
    // No. 20 index = 27
    {
        question: "Side เหลื่อมต้องหนาไม่เกินกี่มิลลิเมตรจึงจะผ่านมาตรฐาน",
        options: ["ไม่เกิน 1.0 มม.", "ไม่เกิน 1.5 มม.", "ไม่เกิน 2.0 มม.", "ไม่เกิน 2.5 มม."],
        correctAnswer: [0],
        model: "../assets/models/wheel20.glb",
        scale: "0.3 0.3 0.3",
        position: "0 0.2 -3",
        points: 1,
        feedback: {
            correct: "Side เหลื่อมใช้เวอร์เนียร์วัดลึก หรือฟิลเลอร์เกจในการวัดค่า และค่าที่ได้ต้องไม่เกิน 1.0 มม. ตามมาตรฐาน",
            incorrect: "ลองศึกษาวิธีการตรวจสอบSide เหลื่อมด้วยเครื่องมือวัดและค่ามาตรฐานที่กำหนด"
        },
        onIncorrect: [24]
    },

];